public class Task_1_2_20 {
    public static void main(String[] args) {
        int a, b;
        a = (int)(Math.random() * 6) + 1;
        b = (int)(Math.random() * 6) + 1;
        System.out.println("a = " + a + " b = " + b);
        System.out.println("a + b = " + (a + b));

    }
}
//1.2.20.Напишите программу, которая выводит сумму двух случайных чисел
//от 1 до 6 (такие результаты могут быть получены при броске кубиков).
